cmsis-svd/cmsis-svd/data/Atmel/ATSAMD21G17A.xml
        <register derivedFrom="PINCFG0_%s">
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PINCFG1_%s</name>
          <description>Pin Configuration n - Group 1</description>
          <addressOffset>0xc0</addressOffset>
        </register>
        <register derivedFrom="PINCFG0_%s">
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PINCFG2_%s</name>
          <description>Pin Configuration n - Group 2</description>
          <addressOffset>0x140</addressOffset>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX0_%s</name>
          <description>Peripheral Multiplexing n - Group 0</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PMUXE</name>
              <description>Peripheral Multiplexing Even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PMUXESelect</name>
                <enumeratedValue>
                  <name>A</name>
                  <description>Peripheral function A selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Peripheral function B selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Peripheral function C selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Peripheral function D selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Peripheral function E selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F</name>
                  <description>Peripheral function F selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G</name>
                  <description>Peripheral function G selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H</name>
                  <description>Peripheral function H selected</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUXO</name>
              <description>Peripheral Multiplexing Odd</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PMUXOSelect</name>
                <enumeratedValue>
                  <name>A</name>
                  <description>Peripheral function A selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Peripheral function B selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Peripheral function C selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Peripheral function D selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Peripheral function E selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F</name>
                  <description>Peripheral function F selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G</name>
                  <description>Peripheral function G selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H</name>
                  <description>Peripheral function H selected</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register derivedFrom="PMUX0_%s">
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX1_%s</name>
          <description>Peripheral Multiplexing n - Group 1</description>
          <addressOffset>0xb0</addressOffset>
        </register>
        <register derivedFrom="PMUX0_%s">
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX2_%s</name>
          <description>Peripheral Multiplexing n - Group 2</description>
          <addressOffset>0x130</addressOffset>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>WRCONFIG%s</name>
          <description>Write Configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PINMASK</name>
              <description>Pin Mask for Multiple Pin Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PMUXEN</name>
              <description>Peripheral Multiplexer Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PULLEN</name>
              <description>Pull Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Output Driver Strength Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMUX</name>
              <description>Peripheral Multiplexing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WRPMUX</name>
              <description>Write PMUX</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRPINCFG</name>
              <description>Write PINCFG</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWSEL</name>
              <description>Half-Word Select</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
